from unicodedata import category

LEXICON_RU: dict[str, str] = {
    # Commands
    '/start': 'Привет!\n\nВас приветствует бот компании "Опора"!\n\n'
              'Здесь можно заказать аренду строительной опалубки,'
              ' а так же проектирование и ее расчет.\n\n'
              'Для более подроного описания введите команду /help',
    '/help':  'Выгодная аренда строительной опалубки — наше преимущество.'
               'Компания предлагает уникальную легкую конструкцию для возведения качественных'
               'и надежных строений. Если при выборе руководствоваться стоимостью, '
               'то взять опалубку в аренду будет лучшим решением.',

    'no_echo': 'Данный тип апдейтов не поддерживается '
               'методом send_copy',

    '/categories':'Выберите категорию:',

    'but_5': 'Кнопка 5',
    'but_6': 'Кнопка 6',
    'but_7': 'Кнопка 7',
}

MAIN_MENU: [tuple[str, int]] = [
    ('Посмотреть каталог',1),
    ('Заказать аренду', 2),
    ('Заказать расчет', 3),
    ('Другие вопросы', 4),
]

BUTTON_HOME:dict[str,str] = {
    'home': '🏠 Вернуться на главное меню'
}

BUTTON_BACK:dict[str,str] = {
    'back': '⬅️ Назад'
}

CONST_BACK:str = '⬅️ Назад'